<?php
/** @noinspection ALL */


if ( $type == 'private' && isset( $message->from ) )
{

    switch ( strtolower( $text ) )
    {

        case '/friendly':
        case '👥 دوستانه':
            apply_filters( 'filter_user_in_game', $chat_id );
            $message = '🔸 برای انجام بازی دوستانه شما میتوانید پس از ایجاد بازی ، لینک دریافتی رو در داخل پی‌وی یا گروهی که قصد دعوت افراد آن به بازی را دارید بفرستید .

🔸 پس از پیوستن دوستانتون درصورتی که تعداد برای بازی کافی نباشد از گزینه ی ( شروع بازی با همین تعداد ) استفاده کنید تا بازیکنان آنلاین به بازی بپیوندند .

🔻 برای دعوت از دوست یا ارسال بازی به گروه یا کانال دکمه زیر را بزنید 👇';
            SendMessage(
                $chat_id, $message, $telegram->buildInlineKeyBoard( [
                [
                    $telegram->buildInlineKeyboardButton( '➕ ایجاد بازی دوستانه و دعوت دیگران', '', '', time() )
                ]
            ] )
            );
            break;

        case '📚 راهنما و قوانین':
        case '📚 راهنمای بازی':
        case '/help':
            $message = '📚 شما به بخش راهنمای بازی مافیا وارد شدید .
برای دریافت توضیحات هر قسمت آن را انتخاب کنید :

❓ بازی مافیا چیست ؟ چگونه باید بازی کنیم ؟
/help_mafia

🎭 چه نقش هایی در بازی وجود دارند و کاربرد هرکدام چگونه‌ست؟ 

🟢 نقش های تیم شهروند : /shahrvand_roles
🔴 نقش های تیم مافیا : /mafia_roles
🟡 نقش های مستقل : /mostaghel_roles
🟣 نقش های شگفت انگیز : /amazing_roles

💡 ترکیب نقش های بازی چطوریه ؟ 

بازی ساده : /help_easy

بازی سخت : /help_hard

بازی مستقل : /help_mostaghel

بازی ویژه : /help_special

👥 چگونه میتونم با دوستم بازی کنم و قوانین بازی دوستانه چیه؟ /help_friendly

🌟 امتیاز چیه و چگونه میتونم سریعتر امتیاز بدست بیارم؟ /help_score

💥 توضیحات لیگ های بازی و امتیاز مورد نیاز برای ورود به آن ها :
/help_league

💰سکه چیست ؟ و چگونه میتونم سکه بدست بیارم ؟ /help_coin

🪄 جادو چیه ؟ هر کدوم از جادوها چه استفاده ای دارند و چگونه باید ازشون استفاده کنیم ؟ /help_magic

⁉️ چگونه میتونم امتیازم رو به اکانت دیگه ای انتقال بدم ؟ /help_account

📋 اصطلاحات بازی /idioms

❓سوالات متداول /questions

درصورتی که برای سوال شما در این قسمت پاسخی پیدا نشد میتونید در قسمت پشتیبانی بپرسید تا بهتون پاسخ بدیم 🌷

لینک ورود به پشتیبانی :
@iranimafia_supbot

⛔️ قوانین ربات 
/ghavanin';
            $telegram->sendMessage( [
                'chat_id'                  => $chat_id,
                'text'                     => $message,
                'parse_mode'               => 'html',
                'disable_web_page_preview' => true
            ] );
            break;

        case '⛔️ قوانین ربات':
        case '/rule':
        case '/ghavanin':
            $message = '
            🚫 قوانین ربات ایرانی مافیا 

❗️اجرای هر یک از موارد ذکر شده در زیر مسدودیت موقت یا دائمی حساب شما را به همراه خواهد داشت .
❗️درصورت مشاهده هر یک از موارد زیر ، کاربر خاطی را گزارش کنید 

🔅 نحوه ی گزارش کردن افراد :
https://t.me/iranimafia/1451

➖ فحاشی و بکار بردن الفاظ رکیک در هر کجای بازی 
➖ لو دادن نقش خود یا دیگران ( یارهای مافیا )
➖ خراب کردن روند بازی به هر صورت 
➖ ارسال پیام های تبلیغاتی از طریق پیام خصوصی
➖ ارسال اسپم 
➖ توهین به اشخاص به هر صورتی 
➖ ابراز جهتگیری های سیاسی و حرف های سیاسی 
➖ توهین به گروه یا فرقه ای خاص ( اعم از ادیان و مقدسات )
➖ به کار بردن الفاظ نژادپرستانه 
➖ درج شماره تلفن ، آیدی ، ایمیل و اطلاعات تماس از طریق پیام خصوصی
➖ آفلاین شدن در بازی درصورت زنده بودن
➖ سوء استفاده از بازی های دوستانه برای تقلب 
➖ نام نامتعارف در پروفایل

➕ قسم خوردن نیز در بازی مجاز نمیباشد .

💯 ما این حق را در اختیار داریم تا حساب هر شخصی را بدون اطلاع قبلی ، بدون ارائه دلیل و در هر زمان مسدود نماییم .

🔰 شما با ثبت نام و بازی کردن با تمامی قوانین ذکر شده در بازی موافقت کرده اید .

💰 خریدهای انجام شده از طریق پرداخت درون ربات از جانب ما به هیچ عنوان قابل عودت دادن نمیباشد . در صورت بروز مشکلی در خرید لطفا با پشتیبانی ربات ارتباط برقرار کنید .

‼️ ضرر های احتمالی بابت خرید و فروش در خارج بازی ( اعم از فروش اکانت یا فروش سکه ) در هر صورت برعهده شخص می‌باشد و پشتیبانی ربات هیچگونه مسئولیتی در قبال این موارد نخواهد داشت . 
🔅 لذا درصورت تمایل به خرید از افراد ، از پشتیبانی استعلام بگیرید .

🚸 کاربران زیر ۱۳ سال مجاز به استفاده از بازی نیستند .

🔰 ما ( پشتیبانی ایرانی مافیا ) در قبال کاربرانمان هیچگونه مسئولیت قضایی و حقوقی نداریم و شما ( کاربر بازی ) هیچگونه ادعای حقوقی ای در رابطه با حق مالکیت حساب کاربری یا آیتم های آن را نخواهید داشت .
            ';
            $telegram->telegram()->sendMessage( $chat_id, $message, null, 'html', [
                'disable_web_page_preview' => true
            ] );
            break;

        case '/help_mafia':
            $message = '
                ❓بازی مافیا چیست و چگونه باید بازی کنیم ؟

•  مافیا از جمله بازی های جذاب و گروهی است که می توانید با استفاده از این ربات در جمع دوستانه و یا درکنار کاربران آنلاین آن را تجربه کنید. شاید بتوان گفت یکی از راه هایی که می توانید از خستگی و روزمرگی زندگیتان تا حدودی رها شوید، دعوت دوستان و نزدیکانتان به بازی مافیا باشد. شما می توانید دوستانتان را به یک چالش دعوت کنید و از لحظات خود لذت ببرید.

•  در این بازی به سه گروه مافیا ، شهروند و مستقل تقسیم میشوند .

•  مافیا در شب با یکدیگر آشنا میشوند و تیم خود را میشناسند اما شهروندان این امکان را ندارند و باید به وسیله حرکات یا موضع گیری های افراد تشخیص دهند که آن فرد جزو کدام تیم است .

•  مافیا تلاش میکند در شب نقش های مهم شهروند را از بازی حذف کند و شهروندان نقش دار (مانند اسنایپر ) نیز در صورت تشخیص درست مافیا میتواند در شب مافیا را از بازی حذف کند و در فاز روز نیز به وسیله رای دادن و اعدام می‌توانند مافیا را از شهر خارج کنند .

•  مستقل هم همانطور که از اسمشان پیداست نه مافیا هستند و نه شهروند ! 
آن ها با کشتن مافیا و شهروندان تلاش میکنند تا برد را از آن خود کنند .

•  برای برد شهروند بازی تا زمانی ادامه دارد که  تمامی مافیاها و مستقل از بازی حذف شوند و برای مافیا و مستقل نیز بالعکس .
                ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/questions':

            $message_id = bot( 'copyMessage', [
                'chat_id'              => $chat_id,
                'from_chat_id'         => CHNNEL_ID,
                'message_id'           => 1615,
                'disable_notification' => true
            ] );


            $message = '[Forwarded from ᴍᴀᴍᴀᴅʀᴇᴢᴀ‌༆]
🔖 سوالات پرتکرار بخش پشتیبانی ایرانی مافیا :

1⃣ برای ورود به بازی سخت چقد امتیاز لازمه ؟

✏️ پاسخ : 350 امتیاز 

2⃣ چرا نمیتونم دارت پرتاب کنم ؟

✏️ پاسخ : باید کشته شده باشی و تا آخر بازی بمونی تا بتونی دارت پرتاب کنی ، روزی هم فقط ۵ بار !

3⃣ چرا نمیشه داخل بازی ویس فرستاد ؟ 

✏️ پاسخ : بررسی کردن ویس داخل ربات کار مشکلیه و وقت زیادی رو از پشتیبانی میگیره ، اما در آپدیت های بعدی ویس و گیف و استیکر رو به قسمت هایی از ربات اضافه میکنیم .

4⃣ انتقال سکه چجوریه : 

✏️ پاسخ : باید روی یکی از پیامای اون فرد ریپلای بزنید و به عنوان مثال بنویسید 5 سکه ، و بقیشم که راحتره ...

5⃣ جادوی محفوظ چجوری عمل میکنه ؟

✏️ پاسخ : این جادو شما رو از کشته دربرابر یک حمله توی شب نجات میده ، به استثنای مافیا حرفه ای و بازپرس یعنی جلوی محکوم کردن بازپرس رو نمیتونه بگیره ..

6⃣ جوایز چالش روزانه چیه ؟

✏️ پاسخ : هر روز به کسایی که جزو پنج نفر اول لیست روزانه باشن برحسب رتبه ، سکه پاداش داده میشه . نفر اول ۲۵ سکه ، نفر دوم ۲۰ سکه و ...

7⃣ یکی رو دعوت کردم ولی سکه هدیه نیومده ، علت چیه ؟ 

✏️ پاسخ : برای اینکه سکه دعوت رو دریافت کنید باید افراد رو از طریق لینک اختصاصی خودتون به بازی دعوت کنید ، همچنین فرد دعوت شده باید یک بازی رو به اتمام برسونه تا سکه ارسال بشه 

8⃣ چجوری میتونیم نقش مورد علاقه بخریم ؟

✏️ پاسخ : درصورتی که بیشتر از ۲ سکه موجودی داشته باشید قبل از شروع منوی خرید نقش بصورت خودکار میاد براتون و میتونید نقش دلخواه خودتون رو بخرید .. قیمت نقش ها متفاوته و جلوش نوشته 

9⃣ استفاده از ربات رایگانه؟

✏️ پاسخ : بازی کردن در ربات کاملا رایگانه اما بخشی از امکانات فوق العاده مثل لیگ های منحصر یا جادوها نیاز به پرداخت سکه دارن

🔟 داخل بازی کنار بعضی اسم ها علامت 🔸 داره ، معنیش چیه ؟

✏️ پاسخ : یعنی اون افراد با همدیگه دوستانه اومدن ، شما هم میتونید از منوی اصلی ربات قسمت دوستانه برای دوستاتون بازی بفرستید و با هم بازی کنید .

1⃣1⃣ کوپن چیه و چجوری باید استفاده کنیم ؟ 

✏️ پاسخ : به کد سکه رایگان کوپن میگیم و توی مناسبت های خاص داده میشه ، برای استفاده از این کد ها هم لازمه ابتدا /code رو داخل ربات بازی بزنید و سپس کدی که فرستادیم رو ارسال کنید تا سکه داده بشه ، اگر با پیام ❌ کوپن نامعتبر است مواجه شدید یعنی مهلت استفاده از کوپن به پایان رسیده .

2⃣1⃣ چجوری از بازی ساده بریم سخت و برعکس .. ؟

✏️ پاسخ : داخل پروفایل یه گزینه وجود داره به نام سناریو بازی ، اونو انتخاب کنید و بعدش روی حالت همیشه بپرس تنظیم کنید . ربات قبل از شروع بازی ازتون میپرسه کدوم نوع بازی رو میخواین استارت کنید. البته باید امتیاز کافی واسه بازی سخت رو داشته باشید تا دکمه ش ظاهر بشه .

سوالات بروزسانی میشه ...🌷';
            if ( !isset( $message_id->message_id ) ) SendMessage( $chat_id, $message, null, null, 'html' );

            break;

        case '/shahrvand_roles':
            $message = '🟢 توضیحات نقش های تیم شهروند :

👷🏻 شهروند ساده : 
ابتدایی‌ترین نقش گروه شهروند است شهروند ساده کسی را در بازی نمی شناسد و باید سعی کند مافیا را شناسایی کند .
او فقط قدرت صحبت کردن در روز و شرکت در رای گیری ها را دارا است .

🔫 اسنایپر :
از اعضای شهروند است که حق شلیک در شب را داراست و در صورت تشخیص مافیا می‌تواند به او شلیک کرده و او را از بازی حذف کند.
 در صورت کشتن اشتباه اعضای شهر دست به خودکشی میزند .

🕵‍♀کاراگاه :
در هر شب یک نفر که حدس میزند مافیا باشد را انتخاب می‌کند تا از هویتش آگاه شود .
استعلام گادفادر برای بار اول غیر مشکوک اعلام میشود .

🔗 بازپرس :
در طول هر روز یکی را انتخاب میکند تا شب بعد از او بازپرسی کند. در شب تصمیم میگیرد که او را محکوم یا آزاد کند. در صورت محکوم کردن اعضای شهروند دیگر نمیتواند کسی را محکوم کند .

💉 پزشک : 
در هر شب یک نفر را که احتمال می دهد مافیا و یا تک تیرانداز آن را کشته باشند نجات می دهد .
او می تواند برای یک شب از جان خود محافظت کند .

🧙‍♀ ساحره :
او می تواند با مرده ها حرف بزند و از عالم غیب برای شهر خبر بیاورد.

👩🏻‍🦳 باکره : 
اگر در طول روز با رای‌گیری از دور بازی خارج شود مافیا در شب بعدی ، قدرت کشتن خود را از دست می‌دهد .

🔎 محقق :
هر شب می تواند یک نفر را انتخاب کند تا نقش او را حدس بزند

🕴کابوی :
 جزو تیم شهروند است که در صورت حذف در طول روز میتواند یک نفر را که احتمال می دهد جزو مافیا است را به همراه خود از بازی بیرون ببرد .
 
کلانتر 👨‍✈️:
کلانتر دو شب در طول بازی میتواند یک نفر را انتخاب کند و آن فرد فردای آن روز قادر به رای دادن نخواهد بود .
همچنین کلانتر پس از آنکه اسنایپر تیرش را شلیک کرد ، میتواند تایید یا عدم تایید به شلیک اسنایپر دهد و در صورتی که عدم تایید بدهد تیر اصابت نخواهد کرد.
درصورت تایید کلانتر اگر اسنایپر به اشتباه شهروند بزند کلانتر حذف خواهند شد.

قاضی 👨🏻‍⚖ : 
در صورت احساس حذف شهروند در رای‌گیری می تواند فقط برای یک بار رای گیری را باطل کند .

🦸‍♂ فدایی : 
یکی از اعضای شهر است که میتواند با فدا کردن خودش جلوی حذف شدن یک نفر را در طول روز بگیرد .
 در صورتی که فدا شده باشد فرشته نمیتواند او را به بازی برگرداند .
 
 👳🏻‍♂کشیش : 
کشیش میتونه جلوی جرم و جنایتو برای یک شب بگیره .
 اون میتونه برای همه دعا کنه و اونشب هیچ کس قادر به استفاده از تواناییاش نیست ! حیف که فقط یکباره .
 
 👀 دیدبان: 
هر شب یکی را انتخاب میکند تا ببیند چه کسانی به خانه ی او رفته اند.

👮🏻‍♂️ پلیس : 
اگر در شب هوشیار بماند به هر کسی که به او قصد حمله کردن داشته باشد شلیک می‌کند ! 
حیف فقط 2 شب در طول بازی میتواند هوشیار بماند.

🤵🏻‍♂ تفنگ دار: 
 تفنگ دار دارای دو فشنگ جنگی و بینهایت فشنگ مشقی می‌باشد . در هر شب می‌تواند به یکی از بازیکنان اسلحه داده و آن شخص می تواند به انتخاب خود یک نفر را بکشد .
 تفنگدار نمی‌تواند از اسلحه خود استفاده کند .
 
 👓 عینک ساز:
 عینک ساز تعداد محدودی عینک دارد و در شب می‌تواند به افراد عینک بدهد. زمانی که به فردی عینک داده می‌شود ، آن شخص می‌تواند استعلام بگیرد .
 
 👰‍♀ فرشته نجات :
فرشته فقط یکبار در طول بازی  در صورتی که خودش کشته نشده باشد می‌تواند از بین افراد کشته شده از تیم شهروند انتخابی داشته باشد و او را زنده کند تا به عنوان شهروند ساده به بازی برگردد .

🏗 معمار:
معمار دوشب میتونه خونه ی افراد شروع به ساخت و ساز کنه . درصورتی که به اون خونه حمله ای بشه ، حمله کننده در آوار کشته میشه .

🛡 زره پوش:
زره پوش با یک حمله کشته نمیشود ، مگر اینکه اعدام شود.

📸 خبرنگار:
بعد از انجام مذاکره توسط گروه مافیا خبرنگار هر شب استعلام یک نفر را می گیرد تا ببیند با چه کسی مذاکره شده است . درصورتی که مذاکره انجام نگرفته شده باشد هرکس را که انتخاب کند میبیند آن فرد چه کاری انجام داده است .
 
 بزرگ خاندان 👴🏻:
 بزرگ اهالی شهر میباشد و درصورتی که در شب کشته شود قاتلش رسوا میشود و نقشش لو میرود .
او همچنین میتواند برای یک بار نتیجه ی رای‌گیری را مشخص کند .

🧟‍♂️ زامبی:
زامبی یک شهروند است که نیاز به درمان دارد ، درصورتی که تا شب چهارم توسط پزشک درمان نشود تبدیل به نوچه مافیا میشود .
بعد از اینکه زامبی درمان شد میتونه از شهر یک نفر رو انتخاب کنه و نقش اون فرد رو تصاحب کنه و اون فرد تبدیل به شهروند ساده میشه 
میتونه نقش یک مرده رو هم برداره ..
زامبی نمیتونه نقش کاراگاه ، محقق ، عینک ساز رو تصاحب کنه';
            SendMessage( $chat_id, $message, null, null, 'html' );

            $message = '
            ناقل 🦠:
ناقل شهروندی است که سال های قبل به آفریقا سفر کرده و مبتلا به یک بیماری ویروسی ناشناخته شده ولی این بیماری با بدنش سازگار شده است.
این فرد هرکسی که نزدیکش شود را مبتلا می کند. بازیکن مبتلا روز اول لال میشود و نمیتواند حرف بزند .
در آن شب نمیتواند از قابلیت خود استفاده کند و در روز بعد علاوه بر اینکه لال هست فلج هم میشود و نمیتواند رای دهد .
در نهایت در شب بعد میمیرد و از بازی حذف میشود.

سناتور 🧾:
سناتور در طول بازی یک‌بار میتونه از قدرتش استفاده کنه و چهار نفر رو لیست کنه ، اگر هر چهار مافیا باشند لیست مخوف خواهد بود ، اگر سه مافیا باشند لیست هایل خواهد بود ، اگر دو مافیا باشند لیست مشکوک خواهد بود و اگر یک مافیا یا بدون مافیا باشد لیست به او غیرمشکوک اعلام خواهد شد .

فراماسون🪬:
فراماسون تیم شهروندی مخفی تشکیل می دهد و میتواند با استفاده از شهروند هایی که پیدا کرده در روز با مافیا مبارزه کند.
در هرشب کسی که فکر می کند شهروند است را انتخاب میکند ، اگر آن شخص شهروند باشد در شب بعد همدیگر را می شناسند و این روند همینجور جلو میرود .
در صورتی که یک مافیا یا یک مستقل به گروه خود دعوت کند اصطلاحا مرگ ماسونی رخ میدهد و همه‌ی اعضای ماسون ها از بازی حذف میشوند.

اعضای ماسون در طول روز حق لو دادن ماسون ها را به بقیه افراد ندارد .
فراماسون حداکثر 4 نفر را میتواند به تیم ماسونی دعوت کند .

آهنگر 👨🏻‍🏭:
آهنگر دو زره دارد و در شب هایی که ماه کامل است میتواند آن را به بازیکنان بدهد.
فردی که زره گرفته است تا آخر بازی در مقابل تیر و رای‌گیری یک زره دارد .
آهنگر نمیتواند به یک نفر دوبار جلیقه بدهد .

 نانوا 🍞:
 شب اول به هیچ وجه کشته نمیشود.
در صورت کشته شدن نانوا، بعد از 5 شبانه روز بازی تمام خواهد شد و مستقل برنده میشود.
اگر مستقل نیز از بازی حذف شده باشد مافیا برنده بازی خواهند بود .

            
            ';
            SendMessage( $chat_id, $message, null, null, 'html' );

            break;

        case '/mafia_roles':
            $message = '🔴توضیحات نقش های تیم مافیا :

🚬 گادفادر : 
رییس همه مافیاها می‌باشد و مافیا را مدیریت میکند تا برنده شوند !
درصورتی که در بازی وجود نداشته باشد معشوقه کار او را انجام میدهد . همچنین استعلام گادفادر برای کاراگاه در دفعه اول اشتباه اعلام می‌شود .

🤵🏻‍♀️ معشوقه : 
عشق و سوگلی !
اگر معشوقه توسط رای گیری از بازی حذف شود گادفادر به دلیل علاقه بیش از حد به او از شدت خشم و ناراحتی در شب بعد دو نفر را میکشد .
اگر گادفادر زودتر از او کشته شود جانشین او میشود و به جای رییس تصمیم میگیرد .

🔪 مافیا حرفه ای : 
قاتل خبره و بی‌رحم مافیاست و از او برای قتل های دشوار استفاده میشود .
یک شب در طول بازی یک نفر را انتخاب میکند و شخصی که توسط مافیا حرفه ای انتخاب شود تحت هر شرایطی میمیرد .

🔍 ناتو : 
در هرشب میتواند نقش دقیق یک نفر را پیدا کند و به مافیا کمک کند تا نقش های مهم را از بازی حذف کنند .

🦹🏻 افسونگر :
هر دو شب یکبار به یک نفر اشاره کرده و نقش آن بازیکن را فقط برای همان شب غیر فعال می کند.

🧑🏻‍💻 هکر :
هر شب تلاش میکند تا یک نفر را هک کند .
درصورتی که آن بازیکن هک شود در روز بعد اجازه رای دادن و صحبت کردن و دفاع کردن از خود را نخواهد داشت .
شانس او برای هک کردن ۵۰ درصد است .

👻 تهمت زن :
هرشب به یکی از بازیکنان اشاره می‌کند .
 اگر کارگاه بازی همان فرد را استعلام کند نتیجه استعلام برای او مشکوک خواهد بود 
 
 🩹 دکترلکتر:
هرشب یک نفر از تیم مافیا را میتواند از خطر تیرخوردن در شب نجات دهد . جان خودش را یک‌بار و هر شب فقط یک نفر را میتواند نجات دهد .

توپچی 💣:
توپچی در طول بازی یک بار میتونه بجای شات مافیا به سمت یک خانه توپ جنگی پرتاب کنه و تمامی افرادی که اونجا باشن کشته میشن .

💆‍♂ شب‌خُسب:
شب‌خسب در طول بازی دوبار میتواند به سراغ افراد شهر رفته و اون ها رو گیج کنه تا به خواب عمیق فرو بروند .
کسی که توسط شب‌خُسب به خواب رفته ، فردای آن روز از تمامی اتفاقات داخل شهر بی‌خبر خواهد ماند .

🤝 مذاکره کننده:
گروه مافیا بعد از خروج یکی از هم‌تیمی های خود ( به جز گادفادر ) و در صورت حضور نقش مذاکره کننده در بازی میتواند با یک نفر اقدام به مذاکره برای پیوستن به تیم مافیا انجام دهند .
مذاکره با بادیگارد ، عینک ساز ، محقق ، پزشک ، کاراگاه و بازپرس موفق نخواهد بود .

دلقک 🤡:
اون میتونه یک بار از قدرتش استفاده کنه و اعضای شهر از شدت خنده و توجه به دلقک نمیتوانند اون شب فعالیتی انجام بدهند ، همچنین فردای آن شب ، شهر قادر به رای گیری نخواهد بود.

شکارچی 🕶:
هرشب در خانه یک‌نفر کمین کنید و یکی از بازدیدکنندگان او را از پا در بیاورید .
شما به اعضای مافیا حمله نخواهید کرد .

دزد 🚷:
شما میتوانید هرشب یک نفر را انتخاب کنید و فعالیت او را بدزدید .
شما در شب بعد امکان استفاده از فعالیت دزدیده شده را خواهید داشت .
نقش بازپرس قابل دزدیدن نخواهد بود .

شیاد 👹:
هر شب یکی را انتخاب کنید تا در صورت مردن خودتان ، نقش او به بقیه نشان داده شود نه نقش مافیای شما .

شاه‌کش 🧛🏿‍♂:
شما باید نقش افراد را حدس بزنید ، در طول بازی و در شب هایی که ماه کامل است تنها دوبار میتوانید نقش کسی را حدس بزنید و در صورت درست بودن حدس ، به او حمله خواهید کرد .

دام 🧱:
از کودکی تنهایی در طبیعت بزرگ شده و توانایی زندگی در شرایط سخت را دارد ، همین باعث شد که به یک شکارچی ماهر تبدیل شود . 
برای دفاع از خود و شکار حیوانات یاد گرفت چگونه تله بسازد و حالا که عضوی از مافیا شده میتواند از این توانایی استفاده کند و در موقعیت دو شخص تله گذاری کند.
دو شب در طول بازی اهداف را انتخاب میکند و به آن ها تله نصب میکند ، اولین بازیکنی به هدف نزدیک شود توسط تله کشته میشود .

';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/mostaghel_roles':
            $message = '🟠 توضیحات نقش های تیم مستقل :

⚔️ زودیاک : 
نه شهروند است و نه مافیا !
هیچکس را نمی‌شناسد و هرشب یک نفر را به قتل میرساند و شاهد نابودی شهروندان و مافیا خواهد بود .

👺 جوکر : 
در صورتی که در رای گیری اعدام شود برنده میشود و انتقام خود را از یکی از کسانی که به او رأی گناهکار داده اند میگیرد !

 👨🏻‍💼 بازمانده :
 بازمانده باید تا پایان بازی زنده بماند تا برنده شود .
بازمانده میتواند هم با تیم شهر و هم با تیم مافیا برنده شود .
او ۲ جلیقه ضدگلوله دارد که در دوشب میتواند تصمیم بگیرد که آنها رو به تن کند.

🐺 گرگ‌نما: 
در شب تبدیل به گرگ میشود و در شب هایی که ماه کامل است اگر تصمیم به حمله بگیرد هم به هدف خود حمله میکند و هم به تمام افرادی که به خانه هدف او بیایند .
در صورتی که در ماه کامل هدفی را انتخاب نکند ، به هر کسی که به خانه او بیاید حمله خواهد کرد .

🪓 جلاد:
در شب اول دو هدف به شما معرفی میشود که باید آن ها را اعدام کنید.  
شما درصورت اعدام شدن اهدافتان برنده میشوید. 
شما همچنین باید هنگام اعدام شدن اهدافتان زنده باشید .
درصورتی که اهداف شما به دلیلی غیر از اعدام کشته شوند شما تبدیل به جوکر می‌شوید .

آشپز 👨🏻‍🍳:
شما میتوانید هر شب یک نفر را مسموم کنید ، هدف شما شب بعد به دلیل مسمومیت خواهد مرد . 
💉 تنها پزشک می تواند مسمومیت شخصی را درمان کند.

عنکبوت 🕷:
عنکبوت هر شب میتواند دو نفر را به هم ببافد ! اگر یکی از آن اشخاص توسط رای‌گیری اعدام شود ، بافته شده نیز همراه او خارج می شود .
عنکبوت داری یک تار مرگبار است که برای بردن نهایی از آن استفاده میکند.

هازارد 🎲:
هر شب یک‌نفر را انتخاب میکند و روی ۱- به داداگاه رفتن و ۲- اعدام شدن او قمار میکند . 
اگر آن شخص روز بعد وارد دادگاه شود شب بعد یک شات بدون نجات به هازارد داده میشود .
و اگر آن فرد علاوه بر رفتن به دادگاه اعدام هم بشود یک زره برای دفاع از حملات به هازارد داده میشود .

نرون 🛢:
شما عاشق سوزاندن افراد هستید !
هر شب یکی را نفتی کنید و هر زمان که بخواهید میتوانید با فندک زدن ، لیست نفتی ها را یک‌جا به آتش بکشید .
همه را بسوزانید و شاهد نابودی شهر و مافیا باشید .

اگر چهار قمار اشتباه کند خودش کشته میشود .

';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/amazing_roles':
            $message = ' توضیحات نقش های تیم شگفت‌انگیز :🟣
            
گمبلر 🤹🏽‍♂:
7 کوین در ابتدای بازی دارد و هر شب می‌تواند با یک نفر سنگ کاغذ قیچی بازی کند.
در صورت برنده شدن، فرد مقابل از بازی خارج میشود اما در صورت باختن ، 2 کوین و در صورت مساوی 1 کوین از گمبلر کم میشود.

در صورتی که کوین‌های گمبلر تمام شود، از بازی خارج می‌شود .

ساغر 👩🏻‍🔬:
متخصص معجون سازی  
6 تا معجون داره که هر شب یکیشو میتونه استفاده کنه :

🧪 معجون مرگ : به هر کی بده اون فرد میمیره 
🧪 معجون بیماری : به هر کسی که این معجون رو بده دو روز بعد میمیره 
🧪 معجون جنون‌آور : هر کس این معجون رو بخوره قابلیتشو شب بعد از دست میده 
🧪 معجون مافیاکُش: به صورت رندوم یکی از اعضای مافیا رو میکشه 
🧪 معجون شهرکُش : به صورت رندوم یکی از اعضای شهرو میکشه 
🧪 معجون نامیرایی: مخصوص خود ساغره ، شبی ک این معجون رو بخوره تا ۲۴ ساعت به هیچ عنوان نمیمیره مگه اینکه با رای گیری بره بیرون
🧪 معجون شگفتی : وقتی این معجون رو استفاده کنه یک نفر از اعضای زنده بازی بصورت شانسی تبدیل به ساغر خواهد شد ، و در صورت کشته شدن ساغر اصلی از معجون های باقیمانده برای برد استفاده خواهد کرد .

سیو پزشک در برابر معجون های ساغر کاربردی نداره ، همچنین ساغر از آلوده شدن به ویروس ناقل در امان است .

💢 درصورتی که معجون های ساغر تموم بشه ولی بازی تموم نشده باشه ، کشته میشه و از بازی میره بیرون پس باید حواسش باشه معجون ها رو چجوری استفاده کنه .


';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_easy':


            $message = '
            توضیحات بازی نوع ساده :

جمعا ۹ بازیکن شامل : 
🔴 ۲ مافیا 
🟢 ۶ شهروند 
🟡 ۱ مستقل 

بازیکنان شهروند :
➖ کاراگاه 
➖ پزشک 
➖ بازپرس 
➖ اسنایپر 
➖ ساحره یا باکره یا کابوی
➖ شهروند ساده یا قاضی یا فدایی 

بازیکنان مافیا : 
➖ گادفادر 
➖ معشوقه

➖ مستقل : جوکر یا زودیاک یا بازمانده
            ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_hard':

            $message = '
            ترکیب بازی سخت : 
مجموعا 12 نفر

🟢 7 نفر شهروند 
🔴 4 نفر مافیا 
🟡 1 مستقل یا 1 شگفت‌انگیز 🟣

♨️ ترکیب تیم شهروند : 
➖ بازپرس 
➖ اسنایپر یا تفنگدار 
➖ محقق یا کاراگاه یا عینک ساز یا سناتور یا فراماسون
➖ پزشک 
➖ ساحره یا کشیش یا فرشته یا یا زره پوش یا زامبی یا ناقل یا تلفن چی یا جادوگر یا مسافر زمان یا نانوا
➖ پلیس یا کلانتر یا بزرگ خاندان 
➖ دیدبان یا معمار یا خبرنگار 

♨️ ترکیب مافیا :
➖ گادفادر 
➖ معشوقه
➖ ناتو
➖ تهمت زن یا هکر یا افسونگر یا مافیا حرفه ای یا توپچی یا شب‌خُسب مذاکره کننده یا دلقک یا شکارچی یا دزد یا دکترلکتر یا شیاد یا شاه کش یا دام

♨️ مستقل : 
➖ جوکر یا زودیاک یا گرگ نما یا جلاد یا آشپز یا عنکبوت یا هازارد

♨️ شگفت‌انگیز : 
➖ ساغر یا گمبلر

            ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_special':

            $message = '
ترکیب بازی ویژه : 
مجموعا 18 نفر

🟢 10 نفر شهروند 
🔴 6 نفر مافیا 
🟡 2 مستقل

♨️ ترکیب تیم شهروند : 
➖ بازپرس 
➖ اسنایپر یا تفنگدار 
➖ کاراگاه
➖ محقق یا عینک ساز یا سناتور
➖ پزشک 
➖ کشیش یا مسافر زمان
➖ ساحره یا زره پوش یا تلفن‌‌چی یا جادوگر
➖ پلیس یا کابوی یا کلانتر
➖ ناقل یا فرشته یا بزرگ خاندان یا قاضی 
➖ دیدبان یا معمار 

♨️ ترکیب مافیا :
➖ گادفادر 
➖ معشوقه
➖ ناتو
➖ مافیا حرفه ای یا توپچی 
➖ دلقک یا دکترلکتر یا دزد یا شکارچی
➖ هکر یا شب‌خسب یا افسونگر یا تهمت زن


♨️ مستقل : 
➖ جوکر یا جلاد یا آشپز 
➖ زودیاک یا گرگ‌نما یا عنکبوت

            ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_mostaghel':
            $message = 'ترکیب بازی تیم مستقل : 
مجموعا 13 نفر

🟢 9 نفر شهروند 
🟡 4 مستقل

♨️ ترکیب تیم شهروند : 
➖ بازپرس 
➖ اسنایپر 
➖ کاراگاه
➖ پزشک 
➖ ساحره یا کشیش
➖ پلیس
➖ دیدبان
➖ تفنگدار
➖ زره پوش

♨️ ترکیب مستقل :
➖ گرگ نما
➖ جوکر
➖ زودیاک 
➖ بازمانده';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_friendly':
            $message = '🔷 شما میتونید دوستانتون رو به بازی دعوت کنید و به اصطلاح بازی دوستانه انجام بدین 
🔸 دقت داشته باشید که اگر تعداد دوستانتون در بازی ساده بیشتر از ۳ نفر  باشد اعضای دوستانه هیچ امتیازی از آن بازی دریافت نمی‌کنند . 

🔸 برای انجام بازی دوستانه شما میتوانید از قسمت منوی اصلی ، 👥 دوستانه را انتخاب کنید و مطابق توضیحات لینک دریافتی رو در داخل پی‌وی یا گروهی که قصد دعوت افراد آن به بازی را دارید بفرستید .

🔸 پس از پیوستن دوستانتون درصورتی که تعداد برای بازی کافی نباشد از گزینه ی ( شروع بازی با همین تعداد ) استفاده کنید تا بازیکنان آنلاین به بازی بپیوندند .';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_score':
            $message = '🔷 امتیاز واحد رقابت در این بازی است که به وسیله کسب امتیاز بیشتر میتونید به لیگ های بالاتر و همچنین جدول رتبه بندی برترین های بازی ، برترین های روزانه و برترین های هفتگی برسید .

🔘 برای کسب امتیاز در این بازی سه روش وجود دارد : 
۱- برنده شدن در بازی

۲- پرتاب موفق دارت 
/score_dart
۳- گزارش صحیح افراد متخلف 
/score_report

🔻 که در ادامه امتیاز توسط برنده شدن در بازی رو توضیح میدیم .

🔸در بازی ساده هر تیمی که موفق به پیروزی شود ، افرادی که از آن تیم تا پایان بازی زنده مانده باشند ۵ امتیاز و اگر کشته شده باشند و تا پایان بازی بمانند ۱ امتیاز دریافت میکنند .
درصورت برد مستقل ۸ امتیاز به او تعلق می‌گیرد . 

🔔 دقت داشته باشید درصورتی که تیم شما برنده شود اما شما قبل پایان بازی ، از آن خارج شده باشید به شما امتیاز تعلق نمیگیرد .

👺 جوکر در صورتی که اعدام شود و تا پایان بازی بماند امتیاز کامل را دریافت میکند .';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/score_dart':
            $message = '
                🎯 فرصت پرتاب دارت برای افرادی که در بازی کشته شده اند و مشمول امتیاز کامل نباشند و تا پایان از بازی خارج نشده باشند داده میشود . به این صورت آنان می‌توانند در پایان بازی از فرصت دارت خود استفاده کنند و اگر پرتاب موفقی داشته باشند ربات به آن ها جایزه ( سکه یا امتیاز ) میدهد . 

🎭 همانطور که گفته شد جوکر ، فدایی و بادیگارد درصورتی که مشمول امتیاز کامل باشند نمی‌توانند از فرصت دارت استفاده کنند .
                ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/score_report':
            $message = '
                🚫 درصورت مشاهده افرادی که قوانین بازی را نقض کنند میتوانید تخلف آن ها را گزارش کنید و درصورت تایید گزارش شما توسط تیم پشتیبانی به شما امتیاز تعلق میگیرد . 

▪️ این امتیاز به ازای هر گزارش صحیح ۳ امتیاز است .

♨️ لطفاً افراد خاطی را گزارش کنید تا فضایی امن و بدون حاشیه برای خود و دوستانمان داشته باشیم .
                ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_league':
            $message = '
                ⁉️ لیگ ها چند نوع هستند :
۱- لیگ امتیازی 
۲- لیگ منحصر 

🔥 لیگ های امتیازی همون‌طور که از اسمشون پیداست به وسیله کسب امتیاز تغییر میکنن و توی بازی نشان دهنده میزان مهارت و تجربه هر فرد در این بازیست .

لیست تمامی لیگ های امتیازی و امتیاز مورد نیاز برای ورود به آن ها رو میتونید در این قسمت ببینید . 

/allscoreleagues

☂️ اما لیگ های منحصر ، ایموجی ‌های خارج از لیگ های امتیازی هستند که هر فرد بنابر علاقه خود میتواند آن را خریداری کند و در کنار اسمش نشان داده میشود که باعث جذابیت بیشتر اسم بازیکن در بازی خواهد بود .

شما میتوانید از قسمت پروفایل » لیگ های منحصر خود را خریداری و استفاده کنید .
                ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/allscoreleagues':
            $message_id = bot( 'copyMessage', [
                'chat_id'              => $chat_id,
                'from_chat_id'         => CHNNEL_ID,
                'message_id'           => 89,
                'disable_notification' => true
            ] );
            $message    = '
            
🔷 لیست تمامی لیگ های امتیازی بازی ایرانی مافیا به همراه امتیاز مورد نیاز برای ورود به آن:

🎗 لیگ مبتدی » بدون امتیاز 🌟
👾 لیگ مخرب » ۱۰۰ امتیاز 🌟
🏵 لیگ نمونه » ۲۲۰ امتیاز 🌟
💥 لیگ شعله ور » ۳۵۰ امتیاز 🌟
☀️ لیگ تابان » ۴۷۰ امتیاز 🌟
✨لیگ درخشان » ۶۰۰ امتیاز 🌟
💫 لیگ هالی » ۷۵۰ امتیاز 🌟
🌈 لیگ رنگین‌کمان » ۹۲۵ امتیاز 🌟
🌪 لیگ طوفان » ۱۱۲۵ امتیاز 🌟
❄️ لیگ برفی » ۱۳۵۰ امتیاز 🌟
🐲 لیگ اژدها » ۱۶۱۰ امتیاز 🌟
🎖 لیگ انتقام جو » ۱۹۰۰ امتیاز 🌟
🏅 لیگ مدال آور » ۲۳۵۰ امتیاز🌟
🥉 لیگ برنز » ۳۰۰۰ امتیاز 🌟
🥈 لیگ نقره ای » ۳۶۵۰ امتیاز 🌟
🥇 لیگ طلایی » ۴۴۰۰ امتیاز 🌟
🧛🏻 لیگ ومپایر » ۵۲۰۰ امتیاز 🌟
🗡 لیگ شوالیه » ۶۲۵۰ امتیاز 🌟
🪖 لیگ دلاوران » ۷۴۰۰ امتیاز 🌟
🏆 لیگ قهرمان » ۸۷۰۰ امتیاز 🌟
💎 لیگ الماس » ۱۳۰۰۰ امتیاز 🌟
🔮 لیگ ماتریس » ۲۰۰۰۰ امتیاز🌟
👑 لیگ پادشاه » ۳۰۰۰۰ امتیاز 🌟
⚜️ لیگ کامپادر »  ۴۵۰۰۰ امتیاز 🌟
🔱 لیگ یانکی  » ۶۵۰۰۰ امتیاز 🌟
🎩 لیگ کاردینال » ۱۰۰۰۰۰ امتیاز🌟

لیست تکمیل خواهد شد ...

موفق باشید 🌷
            
                ';
            if ( !isset( $message_id->message_id ) ) SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_coin':
            $message = '
                🔶 برای اینکه به بعضی از امکانات فوق العاده ربات دسترسی داشته باشید لازم است از سکه استفاده کنید بنابراین سکه یک واحد خرید درون بازی است که به شما توانایی استفاده از امکانات غیررایگان ربات را میدهد .

با استفاده از سکه میتونید : 
۱- ⛱ برای خودتون لیگ اختصاصی با ایموجی دلخواه انتخاب کنید.
۲- 🪄 توی بازی از جادوهای مختلف استفاده کنید تا برنده بشید .
۳- ♨️ نقش دلخواه خودتون رو در هر بازی انتخاب کنید .
۴- 📨 میتونید توی بازی پیام خصوصی بدون محدودیت کلمات انگلیسی بفرستید .
۵ - 🥰 میتونید به دوستاتون سکه هدیه بدین که توضحیش رو میتونید اینجا /Cointransfer ببینید . 
۶- 🌟 عضو کاربرای vip ربات بشین و از خدمات پشتیبانی سریعتر استفاده کنید .

💰روش های دریافت سکه : 

۱- 💳 خرید آنلاین با استفاده از درگاه پرداخت شتابی 
۲- 🎁 دعوت دوستانتون به بازی ( به ازای هر نفر ۵ سکه )
۳- 🎯 پرتاب موفق دارت در پایان بازی
                ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/cointransfer':
            $message = '
                🔸 نحوه انتقال سکه به دوست 

🎊 برای انتقال و هدیه سکه به دوستان خود شما میتونید روی یکی از پیام های اون در بازی ریپلای بزنید و تعداد سکه انتقالی رو مشخص کنید 
برای مثال : ۱۰۰ سکه 
❕ بعد از انجام این کار ربات از شما خواهد پرسید که آیا مطمئن به ارسال سکه هستید ؟ و درصورت کافی بودن موجودی سکه و تایید توسط شما ، سکه مورد نظر ارسال خواهد شد .
                ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_magic':
            $message = 'جادوها به شما این امکان رو میدن تا در بازی بهتر باشید و به کمک اونا به پیروزی نزدیک تر بشین .

لیست جادوهای بازی به همراه کاربرد آن ها رو در پایین مشاهده میکنید :

🎭 ۱- جادوی اثبات /magic1
با استفاده از این جادو میتونید شهروند بودن خودتون رو برای بازیکنان و پیش بازپرس  اثبات کنید . 
سکه مورد نیاز پیش بازپرس ۱ سکه و در دادگاه ۳ سکه 

🔍 ۲- جادوی دقیق /magic2
با استفاده از این جادو میتونید نقش دقیق یک نفر رو ببینید .
سکه مورد نیاز : ۳ 

🛡۳- جادوی محفوظ /magic3
این جادو شما رو برای یک شب از هر خطری محفوظ نگه میداره به این صورت که اگر کسی به شما حمله کرد کشته نمیشوید . 
سکه مورد نیاز : ۵

🤷🏻‍♂️۴- جادوی حذف رای  /magic4
این جادو برای یک بار نام شما رو از لیست رای حذف میکنه و اون روز نمیتونن به شما رای بدن و شما رو اعدام کنند .
سکه مورد نیاز : ۴

🧏🏻‍♂️۵- جادوی جاسوس /magic5
با استفاده از این جادو شما میتونید متوجه بشین که چه زمانی مافیا قصد حمله به شما رو داره .
سکه مورد نیاز : ۴

👨🏻‍💻۶- جادوی ضدهک  /magic6
این جادو درصورتی که شما توسط هکر هک شده باشید کاربرد داره و شما رو از حالت هک خارج می‌کنه
سکه مورد نیاز : ۳

۷- 🥱 جادوی بیداری /magic7
این جادو در زمانی که شما توسط شب‌خُسب به خواب رفته اید باعث میشود تا از خواب بیدار شده و در جریان اتفاقات شهر قرار بگیرید .
سکه مورد نیاز : ۷

❗️ نکته مهم : 
در هر بازی تنها از سه جادو و از هرکدام فقط برای یک بار میشه استفاده کرد .

';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/idioms':
            $message = '🔰 اصطلاحات بازی ایرانی مافیا : 

🔖 در این قسمت اصطلاحات مهمی که توی بازی استفاده میشه و لازمه بدونید رو آماده کردیم تا توی بازی دچار مشکل نشید 🌷
🔅 بازی کردن توی ربات متفاوت با بازیای حضوریه ، به اینصورت که نیازی به فکت آوردن یا ظن زدن نیست بلکه کاراگاه یا محقق بازی از همون اول اداره شهر رو به دست میگیره و اگر کاراگاه از بازی حذف شد بازپرس اینکارو انجام میده .

➖ وقتی زندانی هستید و بازپرس ازتون میپرسه نقش : اگر شهروند هستید باید نقش دقیق خودتون رو بهش بگید ولی اگر مافیا یا مستقل هستید یک نقش شهروند به بازپرس بگید تا باعث بشه در شبای بعد گول بخوره و شهروند رو به اشتباه محکوم به اعدام کنه .

➖ اس : وقتی توی بازی میگن اس یعنی کاراگاه یا محقق بیاد نتیجه استعلام شب قبل رو بگه پس اگر خودتون کاراگاه هستید به شهروندان میگین که استعلام دیشب مشکوک بوده یا نه !

➖ نقطه : این رو فقط محقق ازتون میپرسه و منظورش تعداد کل نقطه های نقشتون هست که باید بصورت عدد بهش بگید و متوجه بشه شما شهروند هستید یا خیر .. برای مثال نقش شما دیدبان هست و محقق بهتون میگه نقطه بده شما باید بگید چهار ! 
اگر خودتون محقق هستید به همین صورت عمل میکنید و اگر مافیا هستید باید یک عدد اشتباهی بگید . 

➖ ادا ( ادعا ) : وقتی یک مافیا نقش شما که شهروند هستید رو برمیداره چه توی دادگاه چه قبل از اون ، شما باید بگید منم 
در این صورت اون فرد اعدام میشه و بازی ادامه پیدا میکنه ...

➖ رندوم : وقتی محقق یا کاراگاه استعلام نداشته باشن ( به هر دلیلی ) اون روز بصورت رندوم یک نفر رو به دادگاه میفرستن .';

            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

        case '/help_account':
            $message = '
            ‼️ چطوری میتونم امتیاز اکانتم رو به اکانت جدیدی منتقل کنم؟

1⃣ مرحله اول:

➖ درصورتی که امتیاز شما از 100 بیشتر باشه توی بخش پروفایل یه گزینه براتون وجود داره که نوشته : ( انتقال به اکانت جدید )
➖ وقتی این گزینه رو بزنید یه ربات کداعتبارسنجی به شما میده که این کد ، حاوی اطلاعات اکانت شماست .
➖ کد رو جایی خارج از اکانت تلگرامتون ذخیره کنید. ( کد نهایتا 48 ساعت فعال میمونه )

➖ سپس برای انتقال اکانت لازمه اکانت فعلی خودتون رو دیلیت کنید ، میتونید از ربات های تلگرامی یا سایت تلگرام این کارو انجام بدید .

2⃣ مرحله دوم :

➖ وارد اکانت مقصد بشید و پس از استارت کردن ربات ایرانی مافیا وارد بخش پروفایل بشید .

❗️ گزینه جدیدی بنام بازیابی اکانت حذف شده وجود دارد که با زدن روی این دکمه از شما میخواد کدتون رو وارد کنید. ( کدی که از پیش ذخیره کردید )

➖ بافاصله با وارد کردن کد ، اکانت شما بازیابی و تمامی مشخصات آن به اکانت جدید انتقال می‌یابد .

⁉️ نکات مهم :

1. برای موفق بودن انتقال حساب ، لازم است اکانت فعلی شما حتما دیلیت شود .

2. کداعتبارسنجی شما کلید انتقال حساب شماست. اگر آن را در اختیار شخص دیگری قرار دادید ، پشتیبانی ربات هیچ مسئولیتی در قبال آن ندارد.

📚 /help
            ';
            SendMessage( $chat_id, $message, null, null, 'html' );
            break;

    }

}